artifacts/benchmarks/memstrata/data/profile-all/N_3/mix_2/result_app_perf_7_redis_ycsb_b.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -B -pl site.ycsb:redis-binding -am package -DskipTests dependency:list -DoutputAbsoluteArtifactFilename -DappendOutput=false -DoutputFile=/tmp/tmpDruW_S'
[INFO] Scanning for projects...
[INFO] ------------------------------------------------------------------------
[INFO] Reactor Build Order:
[INFO] 
[INFO] YCSB Root                                                          [pom]
[INFO] Core YCSB                                                          [jar]
[INFO] Per Datastore Binding descriptor                                   [jar]
[INFO] YCSB Datastore Binding Parent                                      [pom]
[INFO] Redis DB Binding                                                   [jar]
[INFO] 
[INFO] ---------------------------< site.ycsb:root >---------------------------
[INFO] Building YCSB Root 0.18.0-SNAPSHOT                                 [1/5]
[INFO]   from pom.xml
[INFO] --------------------------------[ pom ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ root ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ root ---
[INFO] 
[INFO] --- dependency:3.7.0:list (default-cli) @ root ---
[INFO] 
[INFO] ---------------------------< site.ycsb:core >---------------------------
[INFO] Building Core YCSB 0.18.0-SNAPSHOT                                 [2/5]
[INFO]   from core/pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ core ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ core ---
[INFO] 
[INFO] --- resources:3.3.1:resources (default-resources) @ core ---
[INFO] Copying 1 resource from src/main/resources to target/classes
[INFO] The encoding used to copy filtered properties files have not been set. This means that the same encoding will be used to copy filtered properties files as when copying other filtered resources. This might not be what you want! Run your build with --debug to see which files might be affected. Read more at https://maven.apache.org/plugins/maven-resources-plugin/examples/filtering-properties-files.html
[INFO] 
[INFO] --- compiler:3.7.0:compile (default-compile) @ core ---
[INFO] Changes detected - recompiling the module!
[INFO] Compiling 63 source files to /home/ubuntu/shared/YCSB/core/target/classes
[INFO] 
[INFO] --- resources:3.3.1:testResources (default-testResources) @ core ---
[INFO] skip non existing resourceDirectory /home/ubuntu/shared/YCSB/core/src/test/resources
[INFO] 
[INFO] --- compiler:3.7.0:testCompile (default-testCompile) @ core ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- surefire:3.2.5:test (default-test) @ core ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- jar:3.4.1:jar (default-jar) @ core ---
[INFO] Building jar: /home/ubuntu/shared/YCSB/core/target/core-0.18.0-SNAPSHOT.jar
[INFO] 
[INFO] --- dependency:3.7.0:list (default-cli) @ core ---
[INFO] 
[INFO] --------------< site.ycsb:datastore-specific-descriptor >---------------
[INFO] Building Per Datastore Binding descriptor 0.18.0-SNAPSHOT          [3/5]
[INFO]   from binding-parent/datastore-specific-descriptor/pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ datastore-specific-descriptor ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ datastore-specific-descriptor ---
[INFO] 
[INFO] --- resources:3.3.1:resources (default-resources) @ datastore-specific-descriptor ---
[INFO] Copying 1 resource from src/main/resources to target/classes
[INFO] 
[INFO] --- compiler:3.7.0:compile (default-compile) @ datastore-specific-descriptor ---
[INFO] No sources to compile
[INFO] 
[INFO] --- resources:3.3.1:testResources (default-testResources) @ datastore-specific-descriptor ---
[INFO] skip non existing resourceDirectory /home/ubuntu/shared/YCSB/binding-parent/datastore-specific-descriptor/src/test/resources
[INFO] 
[INFO] --- compiler:3.7.0:testCompile (default-testCompile) @ datastore-specific-descriptor ---
[INFO] No sources to compile
[INFO] 
[INFO] --- surefire:3.2.5:test (default-test) @ datastore-specific-descriptor ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- jar:3.4.1:jar (default-jar) @ datastore-specific-descriptor ---
[INFO] 
[INFO] --- dependency:3.7.0:list (default-cli) @ datastore-specific-descriptor ---
[INFO] 
[INFO] ----------------------< site.ycsb:binding-parent >----------------------
[INFO] Building YCSB Datastore Binding Parent 0.18.0-SNAPSHOT             [4/5]
[INFO]   from binding-parent/pom.xml
[INFO] --------------------------------[ pom ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ binding-parent ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ binding-parent ---
[INFO] 
[INFO] --- dependency:2.10:copy-dependencies (stage-dependencies) @ binding-parent ---
[INFO] 
[INFO] --- dependency:2.10:list (default-cli) @ binding-parent ---
[INFO] 
[INFO] ----------------------< site.ycsb:redis-binding >-----------------------
[INFO] Building Redis DB Binding 0.18.0-SNAPSHOT                          [5/5]
[INFO]   from redis/pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ redis-binding ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ redis-binding ---
[INFO] 
[INFO] --- resources:3.3.1:resources (default-resources) @ redis-binding ---
[INFO] skip non existing resourceDirectory /home/ubuntu/shared/YCSB/redis/src/main/resources
[INFO] 
[INFO] --- compiler:3.7.0:compile (default-compile) @ redis-binding ---
[INFO] Changes detected - recompiling the module!
[INFO] Compiling 2 source files to /home/ubuntu/shared/YCSB/redis/target/classes
[INFO] 
[INFO] --- resources:3.3.1:testResources (default-testResources) @ redis-binding ---
[INFO] skip non existing resourceDirectory /home/ubuntu/shared/YCSB/redis/src/test/resources
[INFO] 
[INFO] --- compiler:3.7.0:testCompile (default-testCompile) @ redis-binding ---
[INFO] No sources to compile
[INFO] 
[INFO] --- surefire:3.2.5:test (default-test) @ redis-binding ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- jar:3.4.1:jar (default-jar) @ redis-binding ---
[INFO] Building jar: /home/ubuntu/shared/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar
[INFO] 
[INFO] --- dependency:2.10:copy-dependencies (stage-dependencies) @ redis-binding ---
[INFO] redis.clients:jedis:jar:2.9.0 already exists in destination.
[INFO] org.apache.commons:commons-pool2:jar:2.4.2 already exists in destination.
[INFO] 
[INFO] --- assembly:2.5.5:single (default) @ redis-binding ---
[WARNING] The following patterns were never triggered in this artifact exclusion filter:
o  '*:sources'

[INFO] Building tar: /home/ubuntu/shared/YCSB/redis/target/ycsb-redis-binding-0.18.0-SNAPSHOT.tar.gz
[INFO] 
[INFO] --- dependency:2.10:list (default-cli) @ redis-binding ---
[INFO] ------------------------------------------------------------------------
[INFO] Reactor Summary for YCSB Root 0.18.0-SNAPSHOT:
[INFO] 
[INFO] YCSB Root .......................................... SUCCESS [  2.545 s]
[INFO] Core YCSB .......................................... SUCCESS [  3.763 s]
[INFO] Per Datastore Binding descriptor ................... SUCCESS [  0.407 s]
[INFO] YCSB Datastore Binding Parent ...................... SUCCESS [  0.856 s]
[INFO] Redis DB Binding ................................... SUCCESS [  1.552 s]
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time:  9.944 s
[INFO] Finished at: 2026-05-11T07:34:58Z
[INFO] ------------------------------------------------------------------------
/usr/lib/jvm/java-8-openjdk-amd64/bin/java -cp /home/ubuntu/shared/YCSB/redis/conf:/home/ubuntu/shared/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/home/ubuntu/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.12/HdrHistogram-2.1.12.jar:/home/ubuntu/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/.m2/repository/redis/clients/jedis/2.9.0/jedis-2.9.0.jar:/home/ubuntu/.m2/repository/org/apache/commons/commons-pool2/2.4.2/commons-pool2-2.4.2.jar:/home/ubuntu/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/ubuntu/shared/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=127.0.0.1 -p redis.port=6379 -p threadcount=3 -t
Command line: -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=127.0.0.1 -p redis.port=6379 -p threadcount=3 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2026-05-11 07:34:59:194 0 sec: 0 operations; est completion in 0 second 
2026-05-11 07:35:09:135 10 sec: 330381 operations; 33034.8 current ops/sec; est completion in 7 minutes [READ: Count=314140, Max=17071, Min=37, Avg=87.41, 50=81, 90=107, 99=177, 99.9=1029, 99.99=5371] [UPDATE: Count=16359, Max=21551, Min=35, Avg=88.75, 50=76, 90=109, 99=224, 99.9=1563, 99.99=10055] 
2026-05-11 07:35:19:135 20 sec: 676113 operations; 34576.66 current ops/sec; est completion in 7 minutes [READ: Count=328463, Max=11007, Min=40, Avg=85.07, 50=81, 90=104, 99=137, 99.9=1023, 99.99=2043] [UPDATE: Count=17164, Max=2613, Min=38, Avg=78.26, 50=74, 90=97, 99=130, 99.9=827, 99.99=2509] 
2026-05-11 07:35:29:135 30 sec: 1024227 operations; 34807.92 current ops/sec; est completion in 6 minutes [READ: Count=330877, Max=11367, Min=36, Avg=84.54, 50=81, 90=102, 99=121, 99.9=927, 99.99=1977] [UPDATE: Count=17248, Max=1187, Min=35, Avg=76.1, 50=73, 90=96, 99=114, 99.9=326, 99.99=1127] 
2026-05-11 07:35:39:135 40 sec: 1369262 operations; 34506.95 current ops/sec; est completion in 6 minutes [READ: Count=327892, Max=14719, Min=40, Avg=85.35, 50=81, 90=105, 99=138, 99.9=336, 99.99=1638] [UPDATE: Count=17155, Max=1407, Min=35, Avg=77, 50=73, 90=98, 99=135, 99.9=301, 99.99=1398] 
2026-05-11 07:35:49:135 50 sec: 1682110 operations; 31284.8 current ops/sec; est completion in 6 minutes [READ: Count=297177, Max=12311, Min=42, Avg=94.21, 50=94, 90=108, 99=127, 99.9=327, 99.99=1692] [UPDATE: Count=15673, Max=1374, Min=40, Avg=86.78, 50=87, 90=101, 99=122, 99.9=282, 99.99=1351] 
2026-05-11 07:35:59:135 60 sec: 2001279 operations; 31916.9 current ops/sec; est completion in 6 minutes [READ: Count=303308, Max=15623, Min=43, Avg=92.39, 50=91, 90=107, 99=131, 99.9=402, 99.99=1451] [UPDATE: Count=15863, Max=9559, Min=37, Avg=84.68, 50=83, 90=99, 99=126, 99.9=295, 99.99=1759] 
2026-05-11 07:36:09:135 70 sec: 2334762 operations; 33344.97 current ops/sec; est completion in 6 minutes [READ: Count=316790, Max=7335, Min=41, Avg=88.35, 50=87, 90=105, 99=131, 99.9=989, 99.99=2331] [UPDATE: Count=16792, Max=2461, Min=40, Avg=80.25, 50=79, 90=97, 99=121, 99.9=656, 99.99=1453] 
2026-05-11 07:36:19:135 80 sec: 2662629 operations; 32789.98 current ops/sec; est completion in 6 minutes [READ: Count=311391, Max=7651, Min=38, Avg=89.83, 50=90, 90=104, 99=127, 99.9=497, 99.99=2483] [UPDATE: Count=16380, Max=11095, Min=35, Avg=82.23, 50=82, 90=96, 99=117, 99.9=265, 99.99=2429] 
2026-05-11 07:36:29:135 90 sec: 2993994 operations; 33136.5 current ops/sec; est completion in 6 minutes [READ: Count=314898, Max=18463, Min=37, Avg=89, 50=84, 90=107, 99=151, 99.9=1154, 99.99=5147] [UPDATE: Count=16472, Max=7347, Min=33, Avg=81.77, 50=76, 90=100, 99=150, 99.9=1061, 99.99=5095] 
2026-05-11 07:36:39:135 100 sec: 3312544 operations; 31855 current ops/sec; est completion in 5 minutes [READ: Count=302605, Max=18975, Min=37, Avg=92.59, 50=89, 90=106, 99=157, 99.9=1269, 99.99=5171] [UPDATE: Count=15904, Max=9791, Min=34, Avg=85.66, 50=81, 90=99, 99=150, 99.9=1436, 99.99=9279] 
2026-05-11 07:36:49:135 110 sec: 3644651 operations; 33210.7 current ops/sec; est completion in 5 minutes [READ: Count=315667, Max=15567, Min=37, Avg=88.67, 50=82, 90=110, 99=162, 99.9=1109, 99.99=5223] [UPDATE: Count=16434, Max=15343, Min=35, Avg=82.26, 50=75, 90=103, 99=156, 99.9=1218, 99.99=8247] 
2026-05-11 07:36:59:135 120 sec: 3997977 operations; 35332.6 current ops/sec; est completion in 5 minutes [READ: Count=335752, Max=18319, Min=34, Avg=83.35, 50=78, 90=98, 99=142, 99.9=1064, 99.99=5271] [UPDATE: Count=17612, Max=6019, Min=34, Avg=75.43, 50=71, 90=91, 99=140, 99.9=976, 99.99=4575] 
2026-05-11 07:37:09:135 130 sec: 4343538 operations; 34556.1 current ops/sec; est completion in 5 minutes [READ: Count=328047, Max=12415, Min=34, Avg=85.27, 50=79, 90=104, 99=141, 99.9=1149, 99.99=5499] [UPDATE: Count=17478, Max=7963, Min=33, Avg=76.71, 50=72, 90=97, 99=126, 99.9=662, 99.99=4359] 
2026-05-11 07:37:19:135 140 sec: 4685639 operations; 34210.1 current ops/sec; est completion in 5 minutes [READ: Count=324851, Max=16199, Min=34, Avg=86.09, 50=82, 90=99, 99=158, 99.9=1168, 99.99=6759] [UPDATE: Count=17293, Max=6939, Min=33, Avg=79.47, 50=74, 90=93, 99=152, 99.9=1340, 99.99=6555] 
2026-05-11 07:37:29:135 150 sec: 5045105 operations; 35946.6 current ops/sec; est completion in 4 minutes [READ: Count=341551, Max=19871, Min=36, Avg=81.88, 50=77, 90=99, 99=130, 99.9=1060, 99.99=5163] [UPDATE: Count=17907, Max=6551, Min=36, Avg=74.65, 50=70, 90=93, 99=127, 99.9=1236, 99.99=2821] 
2026-05-11 07:37:39:135 160 sec: 5380482 operations; 33537.7 current ops/sec; est completion in 4 minutes [READ: Count=318736, Max=11375, Min=38, Avg=87.97, 50=83, 90=107, 99=138, 99.9=1106, 99.99=5227] [UPDATE: Count=16603, Max=8271, Min=35, Avg=80.11, 50=75, 90=100, 99=130, 99.9=988, 99.99=3157] 
2026-05-11 07:37:49:137 170 sec: 5725057 operations; 34450.61 current ops/sec; est completion in 4 minutes [READ: Count=327414, Max=16527, Min=34, Avg=85.59, 50=78, 90=106, 99=161, 99.9=1214, 99.99=6507] [UPDATE: Count=17189, Max=5555, Min=35, Avg=76.93, 50=71, 90=99, 99=157, 99.9=970, 99.99=3565] 
2026-05-11 07:37:59:135 180 sec: 6065187 operations; 34019.8 current ops/sec; est completion in 4 minutes [READ: Count=323086, Max=11127, Min=34, Avg=86.58, 50=83, 90=103, 99=159, 99.9=1190, 99.99=5843] [UPDATE: Count=17035, Max=10207, Min=34, Avg=79.48, 50=76, 90=96, 99=146, 99.9=1093, 99.99=7275] 
2026-05-11 07:38:09:135 190 sec: 6392042 operations; 32685.5 current ops/sec; est completion in 4 minutes [READ: Count=310530, Max=15311, Min=36, Avg=90.16, 50=86, 90=106, 99=156, 99.9=1295, 99.99=6259] [UPDATE: Count=16306, Max=6635, Min=32, Avg=83.39, 50=79, 90=99, 99=149, 99.9=1307, 99.99=6463] 
2026-05-11 07:38:19:135 200 sec: 6740683 operations; 34864.1 current ops/sec; est completion in 4 minutes [READ: Count=331330, Max=16799, Min=35, Avg=84.56, 50=79, 90=105, 99=145, 99.9=1208, 99.99=4699] [UPDATE: Count=17314, Max=10191, Min=34, Avg=77.5, 50=71, 90=100, 99=137, 99.9=1067, 99.99=7319] 
2026-05-11 07:38:29:135 210 sec: 7070145 operations; 32946.2 current ops/sec; est completion in 3 minutes [READ: Count=312815, Max=16591, Min=36, Avg=89.63, 50=86, 90=105, 99=164, 99.9=1205, 99.99=5123] [UPDATE: Count=16644, Max=3091, Min=34, Avg=81.21, 50=79, 90=97, 99=158, 99.9=1094, 99.99=2597] 
2026-05-11 07:38:39:135 220 sec: 7391423 operations; 32124.59 current ops/sec; est completion in 3 minutes [READ: Count=305066, Max=13767, Min=37, Avg=91.93, 50=88, 90=109, 99=163, 99.9=1106, 99.99=6059] [UPDATE: Count=16220, Max=5047, Min=34, Avg=83.18, 50=81, 90=101, 99=149, 99.9=561, 99.99=1733] 
2026-05-11 07:38:49:135 230 sec: 7715958 operations; 32456.75 current ops/sec; est completion in 3 minutes [READ: Count=308478, Max=32463, Min=37, Avg=90.68, 50=86, 90=108, 99=180, 99.9=1205, 99.99=5807] [UPDATE: Count=16066, Max=33151, Min=33, Avg=85.49, 50=79, 90=100, 99=169, 99.9=1426, 99.99=8199] 
2026-05-11 07:38:59:135 240 sec: 8037631 operations; 32167.3 current ops/sec; est completion in 3 minutes [READ: Count=305438, Max=16719, Min=37, Avg=91.56, 50=88, 90=109, 99=166, 99.9=1182, 99.99=6423] [UPDATE: Count=16218, Max=13255, Min=34, Avg=85.43, 50=80, 90=101, 99=159, 99.9=1194, 99.99=10287] 
2026-05-11 07:39:09:135 250 sec: 8360550 operations; 32291.9 current ops/sec; est completion in 3 minutes [READ: Count=306816, Max=37247, Min=38, Avg=91.31, 50=87, 90=108, 99=159, 99.9=1091, 99.99=5083] [UPDATE: Count=16103, Max=21711, Min=37, Avg=84.91, 50=79, 90=100, 99=154, 99.9=1086, 99.99=10591] 
2026-05-11 07:39:19:135 260 sec: 8710179 operations; 34962.9 current ops/sec; est completion in 3 minutes [READ: Count=332162, Max=11871, Min=35, Avg=84.28, 50=78, 90=101, 99=160, 99.9=1116, 99.99=4579] [UPDATE: Count=17482, Max=5871, Min=36, Avg=76.62, 50=70, 90=96, 99=149, 99.9=794, 99.99=4667] 
2026-05-11 07:39:29:135 270 sec: 9061335 operations; 35115.6 current ops/sec; est completion in 2 minutes [READ: Count=333719, Max=19407, Min=37, Avg=83.91, 50=78, 90=101, 99=160, 99.9=1125, 99.99=3901] [UPDATE: Count=17429, Max=8087, Min=33, Avg=78.22, 50=71, 90=97, 99=158, 99.9=1441, 99.99=7271] 
2026-05-11 07:39:39:135 280 sec: 9381454 operations; 32011.9 current ops/sec; est completion in 2 minutes [READ: Count=304376, Max=11503, Min=36, Avg=92.37, 50=87, 90=110, 99=167, 99.9=1302, 99.99=5455] [UPDATE: Count=15745, Max=10503, Min=38, Avg=82.95, 50=79, 90=102, 99=148, 99.9=451, 99.99=2353] 
2026-05-11 07:39:49:135 290 sec: 9713008 operations; 33155.4 current ops/sec; est completion in 2 minutes [READ: Count=314894, Max=13039, Min=37, Avg=88.86, 50=83, 90=106, 99=172, 99.9=1289, 99.99=6211] [UPDATE: Count=16651, Max=10439, Min=34, Avg=81.48, 50=75, 90=98, 99=163, 99.9=1480, 99.99=4015] 
2026-05-11 07:39:59:135 300 sec: 10066892 operations; 35388.4 current ops/sec; est completion in 2 minutes [READ: Count=336077, Max=11903, Min=38, Avg=83.19, 50=78, 90=102, 99=150, 99.9=1171, 99.99=5171] [UPDATE: Count=17807, Max=4563, Min=36, Avg=74.66, 50=70, 90=95, 99=138, 99.9=1054, 99.99=3579] 
2026-05-11 07:40:09:135 310 sec: 10418624 operations; 35173.2 current ops/sec; est completion in 2 minutes [READ: Count=334244, Max=12055, Min=36, Avg=83.73, 50=78, 90=99, 99=149, 99.9=1104, 99.99=5443] [UPDATE: Count=17493, Max=12927, Min=34, Avg=77.06, 50=70, 90=94, 99=144, 99.9=1078, 99.99=8607] 
2026-05-11 07:40:19:135 320 sec: 10750666 operations; 33200.88 current ops/sec; est completion in 2 minutes [READ: Count=315441, Max=11207, Min=36, Avg=88.76, 50=82, 90=112, 99=164, 99.9=1201, 99.99=3937] [UPDATE: Count=16608, Max=6943, Min=31, Avg=81.33, 50=74, 90=106, 99=159, 99.9=1167, 99.99=3097] 
2026-05-11 07:40:29:135 330 sec: 11074886 operations; 32425.24 current ops/sec; est completion in 1 minute [READ: Count=307753, Max=29503, Min=38, Avg=91.09, 50=86, 90=110, 99=168, 99.9=1176, 99.99=6011] [UPDATE: Count=16460, Max=7187, Min=35, Avg=83.74, 50=79, 90=102, 99=159, 99.9=1230, 99.99=6543] 
2026-05-11 07:40:39:135 340 sec: 11435207 operations; 36032.1 current ops/sec; est completion in 1 minute [READ: Count=342333, Max=17055, Min=35, Avg=81.78, 50=76, 90=98, 99=155, 99.9=1076, 99.99=5703] [UPDATE: Count=17996, Max=2855, Min=33, Avg=73.5, 50=69, 90=93, 99=145, 99.9=869, 99.99=2637] 
2026-05-11 07:40:49:135 350 sec: 11793815 operations; 35860.8 current ops/sec; est completion in 1 minute [READ: Count=340486, Max=15351, Min=36, Avg=81.98, 50=76, 90=98, 99=148, 99.9=1228, 99.99=6135] [UPDATE: Count=18116, Max=7383, Min=31, Avg=76.33, 50=69, 90=92, 99=142, 99.9=1584, 99.99=6831] 
2026-05-11 07:40:59:135 360 sec: 12121186 operations; 32737.1 current ops/sec; est completion in 1 minute [READ: Count=310943, Max=18959, Min=38, Avg=90.06, 50=85, 90=108, 99=168, 99.9=1166, 99.99=5075] [UPDATE: Count=16421, Max=7035, Min=35, Avg=82.1, 50=77, 90=100, 99=156, 99.9=1247, 99.99=4183] 
2026-05-11 07:41:09:135 370 sec: 12464861 operations; 34367.5 current ops/sec; est completion in 1 minute [READ: Count=326479, Max=11295, Min=37, Avg=85.81, 50=80, 90=103, 99=136, 99.9=1188, 99.99=5315] [UPDATE: Count=17196, Max=3691, Min=33, Avg=77.37, 50=72, 90=97, 99=130, 99.9=1143, 99.99=3503] 
2026-05-11 07:41:19:135 380 sec: 12791916 operations; 32705.5 current ops/sec; est completion in 1 minute [READ: Count=310771, Max=16623, Min=39, Avg=90.24, 50=84, 90=107, 99=160, 99.9=1240, 99.99=6355] [UPDATE: Count=16284, Max=8463, Min=35, Avg=81.5, 50=77, 90=99, 99=150, 99.9=938, 99.99=5099] 
2026-05-11 07:41:29:135 390 sec: 13140140 operations; 34822.4 current ops/sec; est completion in 56 seconds [READ: Count=330759, Max=23071, Min=37, Avg=84.69, 50=79, 90=100, 99=160, 99.9=1167, 99.99=4255] [UPDATE: Count=17470, Max=4107, Min=35, Avg=76.64, 50=71, 90=96, 99=151, 99.9=1020, 99.99=3649] 
2026-05-11 07:41:39:135 400 sec: 13486500 operations; 34636 current ops/sec; est completion in 45 seconds [READ: Count=328998, Max=36575, Min=37, Avg=85.23, 50=79, 90=105, 99=157, 99.9=1147, 99.99=5067] [UPDATE: Count=17361, Max=4995, Min=34, Avg=76.11, 50=72, 90=99, 99=145, 99.9=804, 99.99=1624] 
2026-05-11 07:41:49:135 410 sec: 13814471 operations; 32793.82 current ops/sec; est completion in 36 seconds [READ: Count=311519, Max=15071, Min=37, Avg=89.97, 50=84, 90=108, 99=171, 99.9=1272, 99.99=5615] [UPDATE: Count=16457, Max=3981, Min=33, Avg=80.62, 50=77, 90=100, 99=154, 99.9=842, 99.99=2809] 
2026-05-11 07:41:59:135 420 sec: 14155749 operations; 34127.8 current ops/sec; est completion in 26 seconds [READ: Count=324381, Max=13695, Min=38, Avg=86.38, 50=80, 90=105, 99=151, 99.9=1264, 99.99=5395] [UPDATE: Count=16888, Max=10807, Min=36, Avg=78.88, 50=72, 90=97, 99=143, 99.9=1322, 99.99=9175] 
2026-05-11 07:42:09:135 430 sec: 14496203 operations; 34048.8 current ops/sec; est completion in 15 seconds [READ: Count=323193, Max=17375, Min=37, Avg=86.64, 50=80, 90=105, 99=171, 99.9=1239, 99.99=5771] [UPDATE: Count=17267, Max=7587, Min=34, Avg=78.61, 50=72, 90=98, 99=158, 99.9=1134, 99.99=3231] 
2026-05-11 07:42:19:135 440 sec: 14827375 operations; 33113.89 current ops/sec; est completion in 6 second [READ: Count=314579, Max=19903, Min=37, Avg=89.02, 50=87, 90=101, 99=155, 99.9=1320, 99.99=5399] [UPDATE: Count=16599, Max=5951, Min=33, Avg=81.94, 50=80, 90=94, 99=148, 99.9=1494, 99.99=5391] 
2026-05-11 07:42:25:096 445 sec: 15000000 operations; 28963.93 current ops/sec; [READ: Count=164015, Max=13295, Min=35, Avg=75.19, 50=66, 90=100, 99=125, 99.9=940, 99.99=3901] [CLEANUP: Count=3, Max=1450, Min=65, Avg=530.33, 50=76, 90=1450, 99=1450, 99.9=1450, 99.99=1450] [UPDATE: Count=8598, Max=1234, Min=27, Avg=66.68, 50=59, 90=92, 99=111, 99.9=263, 99.99=1234] 
[OVERALL], RunTime(ms), 445961
[OVERALL], Throughput(ops/sec), 33635.2281925998
[TOTAL_GCS_PS_Scavenge], Count, 2002
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2540
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5695565307280233
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2002
[TOTAL_GC_TIME], Time(ms), 2540
[TOTAL_GC_TIME_%], Time(%), 0.5695565307280233
[READ], Operations, 14250240
[READ], AverageLatency(us), 87.2844294552232
[READ], MinLatency(us), 34
[READ], MaxLatency(us), 37247
[READ], 50thPercentileLatency(us), 82
[READ], 95thPercentileLatency(us), 112
[READ], 99thPercentileLatency(us), 155
[READ], Return=OK, 14250240
[CLEANUP], Operations, 3
[CLEANUP], AverageLatency(us), 530.3333333333334
[CLEANUP], MinLatency(us), 65
[CLEANUP], MaxLatency(us), 1450
[CLEANUP], 50thPercentileLatency(us), 76
[CLEANUP], 95thPercentileLatency(us), 1450
[CLEANUP], 99thPercentileLatency(us), 1450
[UPDATE], Operations, 749760
[UPDATE], AverageLatency(us), 79.88714388604353
[UPDATE], MinLatency(us), 27
[UPDATE], MaxLatency(us), 33151
[UPDATE], 50thPercentileLatency(us), 75
[UPDATE], 95thPercentileLatency(us), 106
[UPDATE], 99thPercentileLatency(us), 149
[UPDATE], Return=OK, 749760